Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: །བདག་གིས་ནི་བསྒོམ་པར་བྱའོ།
en: I should cultivate it.

source: །བདག་གིས་ནི་བརྩམ་པར་བྱའོ།
en: I should undertake it.

source: །འདི་ནི་བསམ་གཏན་ནོ།
en: This is meditative concentration.

source: །བདག་གིས་ནི་མཉམ་པར་གཞག་པར་བྱའོ་འདི་ནི་ཤེས་རབ་བོ་བདག་གིས་ནི་བསྒོམ་པར་བྱའོ།
en: I should be absorbed in it. This is wisdom. I should cultivate it!’

source: ཞེས་ཐ་དད་པར་སྤྱོད་པས་དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་ཞིང་ཐབས་མཁས་པས་ཡོངས་སུ་མ་བཟུང་བར་སྦྱིན་པ་གཏོང་།
en: Separated from the perfection of wisdom and without being favored with skill in means, they say, ‘I should dispense gifts.

source: ཚུལ་ཁྲིམས་སྲུང་།
en: I should maintain ethical discipline.

source: བཟོད་པ་སྒོམ།
en: I should cultivate tolerance.

source: བརྩོན་འགྲུས་རྩོམ།
en: I should undertake perseverance.

source: བསམ་གཏན་ལ་མཉམ་པར་གཞོག་ཤེས་རབ་ལ་གོམས་པར་བྱེད་ཅིང་།
en: I should be absorbed in meditative concentration. I should cultivate wisdom.’

source: དེ་དག་འདུ་ཤེས་སྣ་ཚོགས་ཀྱིས་སྤྱོད་པས་ཐ་མི་དད་པས་མ་དམིགས་པའི་ཕྱིར།
en: They engage with diverse notions, so that they do not apprehend by means of nondifferentiation.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་མ་ཞུགས་སོ།
en: This is why they have not entered into the maturity of the bodhisattvas.

source: །དེ་དག་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་མ་ཞུགས་པས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་ཐོབ།
en: Since they have not entered into the maturity of the bodhisattvas, they have attained the fruit of entering the stream to nirvāṇa and they have attained [the other fruits], up to and including arhatship. “

source: དགྲ་བཅོམ་པ་ཉིད་ཀྱི་བར་དུ་ཐོབ་བོ། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱི་ལམ་སྟོང་པ་ཉིད་དམ་མཚན་མ་མེད་པའམ་སྨོན་པ་མེད་པ་ཡོད་མོད་ཀྱི། དེ་དག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་ཞིང་ཐབས་མཁས་པས་ཡོངས་སུ་མ་བཟུང་ན་ཡང་དག་པའི་མཐའ་མངོན་དུ་བྱས་ནས། ཉན་ཐོས་སམ། རང་སངས་རྒྱས་སུ་འགྱུར་རོ།
en: Śāradvatīputra, although the path of those bodhisattva great beings does possess emptiness, signlessness, and wishlessness, they are still separated from the perfection of wisdom and have not yet been favored with skill in means, for which reasons, after they have actualized the very limit of reality, they will become śrāvakas or pratyekabuddhas.” {

source: བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་སྟོང་པ་ཉིད་དང་མཚན་མ་མ་མཆིས་པ་དང་། སྨོན་པ་མ་མཆིས་པའི་ཆོས་དེ་དག་ཉིད་ལ་བསྒོམ་དུ་འདྲ་ཡང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་ཞིང་ཐབས་མཁས་པ་དང་བྲལ་བ་རྣམས་ནི་ཡང་དག་པའི་མཐའ་སྔོན་དུ་བགྱིས་ཤིང་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་སུ་འགྱུར་ལ། བྱང་ཆུབ་སེམས་དཔའ་ཐབས་མཁས་པས་ཡོངས་སུ་བཟུང་བ་དག་ནི། སྟོང་པ་ཉིད་དང་མཚན་མ་མ་མཆིས་པ་དང་སྨོན་པ་མ་མཆིས་པའི་ཆོས་དེ་དག་ཉིད་ལ་བསྒོམ་དུ་བས་ཀྱང་། ཐབས་མཁས་པ་ལ་རྟེན་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འགྱུར།
en: IV: 126} “Blessed Lord, why is it that those who seem to cultivate the nature of phenomena that is emptiness, signlessness, and wishlessness, but are still separated from the perfection of wisdom and have not yet been favored with skill in means, [merely] actualize the very limit of reality and become śrāvakas or pratyekabuddhas, whereas bodhisattvas who have been favored with skill in means also cultivate the nature of phenomena that is emptiness, signlessness, and wishlessness, and, in addition, depend upon skill in means and attain consummate buddhahood in unsurpassed, complete enlightenment?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་ཁ་ཅིག་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དང་བྲལ་བ། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཆོས་འབའ་ཞིག་བསྒོམ་པ་ནི་ཐབས་མཁས་པ་མ་ཐོབ་པས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་སུ་འགྱུར་རོ།
en: Śāradvatīputra,” replied the Blessed One, “in this regard, there are some persons whose minds are without all-aspect omniscience and who absolutely cultivate the nature of phenomena that is emptiness, signlessness, and wishlessness, but they [merely] become śrāvakas or pratyekabuddhas because they are without skill in means.

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མ་བྲལ་བ་རྣམས་ནི་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་ཆོས་རྣམས་ལ་སྒོམ་ཞིང་ཐབས་མཁས་པ་ཐོབ་པས་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་ཅིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱའོ། །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལྟ་སྟེ་དཔེར་ན།
en: Again, Śāradvatīputra, there are bodhisattva great beings whose minds are not without all-aspect omniscience, who cultivate [the nature of] phenomena that is emptiness, signlessness, and wishlessness, and then enter a bodhisattva’s full maturity and attain consummate buddhahood in unsurpassed, complete enlightenment because they are not without skill in means.

source: བྱ་ཞིག་ལ་ལུས་དཔག་ཚད་བརྒྱ་པའམ། དཔག་ཚད་ཉིས་བརྒྱ་པ་འམ་དཔག་ཚད་སུམ་བརྒྱ་པའམ། དཔག་ཚད་བཞི་བརྒྱ་པ་འམ། དཔག་ཚད་ལྔ་བརྒྱ་པ་ཞིག་ཡོད་ལ། དེ་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་རིས་ནས་འདིར་འོང་བར་འདོད་ལ།
en: As an analogy, Śāradvatīputra, suppose there were a wingless bird with a body one hundred yojanas, two hundred yojanas, three hundred yojanas, four hundred yojanas, or five hundred yojanas in size, who wished to migrate here from the god realm of Trayastriṃśa, thinking, ‘I should dwell in Jambudvīpa!’

source: བྱ་དེ་ལ་ཡང་འདབ་མ་མེད་པ་ཞིག་སྟེ། དེ་འཛམ་བུའི་གླིང་དུ་གནས་སོ་སྙམ་ནས། སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་རིས་ནས་བདག་ཉིད་མཆོངས་ཏེ། གལ་ཏེ་བྱ་དེས་ལམ་ནས་ག་རེ་བདག་གིས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་རིས་སུ་གནས་པར་བྱའོ་སྙམ་དུ་བསམས་ན། ཤ་ར་དྭ་ཏའི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། བྱ་དེས་ཕྱིར་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷའི་རིས་སུ་གནས་པར་ནུས་སམ་གསོལ་པ།
en: And having taken off from the god realm of Trayastriṃśa, if that bird were to have second thoughts on the way down, considering, ‘Now I should stay in the god realm of Trayastriṃśa,’ do you think, Śāradvatīputra, that this [wingless] bird would be able to resettle in the god realm of Trayastriṃśa?” “

source: གལ་ཏེ་ལམ་ནས་འདི་སྙམ་དུ་མ་ལ་བདག་གིས་ཅི་ནས་ཀྱང་མ་སྨས་མ་སྣད་པར་འཛམ་བུའི་གླིང་དུ་འདུག་པར་བྱའོ་སྙམ་ན།
en: The Blessed One continued, “If this [wingless bird], while descending from there, were to think, ‘Oh! May I land in Jambudvīpa, without being wounded or injured at all!’

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལ་ཇི་སྙམ་དུ་སེམས། བྱ་དེ་འཛམ་བུའི་གླིང་དུ་མ་སྨས་མ་སྣད་པར་འདུག་པར་འགྱུར་རམ། གསོལ་པ།
en: do you think, Śāradvatīputra, that this [wingless] bird would land in Jambudvīpa, without being wounded or injured?” “

source: །བཅོམ་ལྡན་འདས་དེ་ནི་འཛམ་བུའི་གླིང་དུ་ལྷུང་ནས་སྨས་པ་འམ་སྣད་པར་ཡང་འགྱུར། འགུམ་པའམ། གུམ་ལ་ཐུག་པར་སྡུག་བསྔལ་བར་ཡང་འགྱུར་རོ།
en: It would fall to Jambudvīpa, wounded and injured, and die, or experience mortal sufferings.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ལྟར་ལུས་ཆེ་ལ་འདབ་མ་མ་མཆིས་པ་དེ་ནི་དེ་ལྟར་འགྱུར་དུ་གདོན་མི་འཚལ་ལོ།
en: If one were to ask why, Blessed Lord, it is because this is undoubtedly what would happen to any bird whatsoever, with such a large body and no wings.” “It is so, Śāradvatīputra.

source: ཤ་ར་དྭ་ཏིའི་བུ་དེ་བཞིན་དུ་བྱང་ཆུབ་སེམས་དཔའ་བསྐལ་པ་གང་གཱའི་ཀླུང་གི་བྱེ་མ་སྙེད་ཏུ་སྦྱིན་པ་གཏོང་ཞིང་ཚུལ་ཁྲིམས་སྲུང་། བཟོད་པ་བསྒོམ། བརྩོན་འགྲུས་རྩོམ། བསམ་གཏན་ལ་མཉམ་པར་གཞོག་ཅིང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བྱ་བའི་ཕྱིར་དེའི་སྨོན་པ་ཡང་ཆེ།
en: However much bodhisattvas may aspire to dispense generosity, maintain ethical discipline, cultivate tolerance, undertake perseverance, be absorbed in meditative concentration, and attain consummate buddhahood in unsurpassed, complete enlightenment, over eons as numerous as the grains of sand of the river Gaṅgā, and however much they set their minds upon that, even though the sustenance they have obtained might indeed be limitless, if they are separated from perfection of wisdom and have not been favored with skill in means they will descend to the level of the śrāvakas or the level of the pratyekabuddhas. {

source: དེའི་སེམས་བསྐྱེད་པ་ཡང་ཆེ། ཡོངས་སུ་འཛིན་པ་ཡང་ཚད་མེད་དུ་ཟིན་ཀྱང་།
en: Ki.

source: ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་ཞིང་ཐབས་མཁས་པས་ཡོངས་སུ་མ་བཟུང་ན་ཉན་ཐོས་ཀྱི་སའམ་རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་ངོ་། དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་དེས་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་སེམས་དང་མི་ལྡན་པར་སྦྱིན་པ་བྱིན། ཚུལ་ཁྲིམས་བསྲུངས། བཟོད་པ་བསྒོམས། བརྩོན་འགྲུས་བརྩམས། བསམ་གཏན་བསྒྲུབས་པས། བྱང་ཆུབ་སེམས་དཔའ་དེ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་བྲལ་ཞིང་ཐབས་མཁས་པས་ཡོངས་སུ་མ་བཟུང་བའི་ཕྱིར། ཉན་ཐོས་ཀྱི་ས་འམ། རང་སངས་རྒྱས་ཀྱི་སར་ལྟུང་ངོ་།
en: IV: 127} If you ask why, it is because by dispensing generosity, maintaining ethical discipline, cultivating tolerance, undertaking perseverance, and achieving meditative concentration without the mind set on all-aspect omniscience, those bodhisattvas will descend to the level of the śrāvakas or the level of the pratyekabuddhas because they are separated from perfection of wisdom and have not been favored with skill in means. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་འདས་པ་དང་། མ་འོངས་པ་དང་ད་ལྟར་བྱུང་བའི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་དང་ཏིང་ངེ་འཛིན་དང་ཤེས་རབ་དང་རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པ་སེམས་ཤིང་འཛིན་ལ་མཚན་མར་བྱེད་ཀྱང་། དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་མི་ཤེས། ཏིང་ངེ་འཛིན་དང་ཤེས་རབ་དང་རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པ་མི་ཤེས་ན། དེ་མི་ཤེས་ཁོང་དུ་མ་ཆུད་པས་སྟོང་པ་ཉིད་དང་།
en: Moreover, Śāradvatīputra, when bodhisattvas consider, grasp, and conceptualize the ethical disciplines, meditative stabilities, wisdom, and liberation of the tathāgatas of the past, future, and present, along with their seeing the wisdom of liberation, if they do not understand the ethical discipline of the tathāgatas, and if they do not understand their meditative stabilities, wisdom, liberation, and seeing the wisdom of liberation, owing to their lack of understanding and lack of comprehension, they will hear talk about emptiness, signlessness, and wishlessness and tranquilly conceptualize about them; and having tranquilly conceptualized about them, they will even dedicate these toward unsurpassed, complete enlightenment.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའི་སྒྲ་ཐོས་ནས་དེ་ནི་དེ་དག་ལ་ཞི་བར་མཚན་མར་འཛིན་ཏེ། དེ་དག་ལ་ཞི་བར་མཚན་མར་བཟུང་ཞིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོའོ། །དེ་ལྟར་ཡོངས་སུ་བསྔོ་བའི་བྱང་ཆུབ་སེམས་དཔའ་ནི་ཉན་ཐོས་ཀྱི་སའམ་རང་སངས་རྒྱས་ཀྱིས་ལ་གནས་པར་འགྱུར་རོ།
en: Bodhisattvas, making such dedications, will settle into the level of the śrāvakas or the level of the pratyekabuddhas.

source: །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ཅིའི་ཕྱིར་ཞེ་ན། དེ་ལྟར་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ཐབས་མཁས་པ་དང་བྲལ་བས་དགེ་བའི་རྩ་བ་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡོངས་སུ་བསྔོ་བ་ནི་དེ་ལྟར་འགྱུར་དུ་གདོན་མི་ཟའོ།
en: If you ask why, Śāradvatīputra, it is because those who dedicate these roots of virtuous action to unsurpassed, complete enlightenment will undoubtedly incur this outcome because they are separated from the perfection of wisdom and are without skill in means. “

source: །ཤ་ར་དྭ་ཏིའི་བུ་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐོག་མ་སེམས་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པའི་སེམས་དང་མ་བྲལ་བར་སྦྱིན་པ་གཏོང་ཞིང་ཚུལ་ཁྲིམས་སྲུང་བ་དང་བཟོད་པ་སྒྲུབ་པ་དང་། བརྩོན་འགྲུས་རྩོམ་པ་དང་བསམ་གཏན་ལ་མཉམ་པར་གཞོག་པ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ཐབས་མཁས་པ་དང་མ་བྲལ་བ་སྟེ།
en: In this regard, Śāradvatīputra, bodhisattva great beings who, starting from the time when they first begin to set their mind on enlightenment, dispense generosity, maintain ethical discipline, cultivate tolerance, undertake perseverance, and are absorbed in meditative concentration, without being separated from the mind set on all-aspect omniscience, will not be without the perfection of wisdom and skill in means.

source: འདས་པ་དང་། མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་དང་ཏིང་ངེ་འཛིན་དང་ཤེས་རབ་དང་རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པ་དེ་ལ་མཚན་མར་མི་བྱེད་དེ།
en: They will not conceptualize the ethical discipline of the lord buddhas of the past, future, and present, or their meditative stability, wisdom, liberation, and seeing the wisdom of liberation.

source: སྟོང་པ་ཉིད་ཀྱི་ཏིང་ངེ་འཛིན་ལ་མཚན་མར་མི་འཛིན་མཚན་མ་འཛིན། མཚན་མ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་མཚན་མར་མི་འཛིན། སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་ལ་མཚན་མར་མི་འཛིན་ན། ཤ་ར་དྭ་ཏིའི་བུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལ་གནས་པར་མི་འགྱུར་བར་རིག་པར་བྱའོ།
en: If they do not conceptualize the meditative stability of emptiness, do not conceptualize the meditative stability of signlessness, and do not conceptualize the meditative stability of wishlessness, you should know, Śāradvatīputra, that those bodhisattva great beings will not settle into the level of the śrāvakas or the level of the pratyekabuddhas. {

source: དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་ཐོག་མ་སེམས་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སྦྱིན་པ་བྱིན་ཡང་མཚན་མར་མ་བཟུང་།
en: IV: 128} If you ask why, it Is because those bodhisattva great beings, commencing from the tine when they first begin to set their mind on enlightenment, have dispensed generosity but have not conceptualized it.

source: ཚུལ་ཁྲིམས་བསྲུངས་ཀྱང་མཚན་མར་མ་བཟུང་བཟོད་པས་བསྒྲུབས་ཀྱང་མཚན་མར་མ་བཟུང་།
en: They have maintained ethical discipline but they have not conceptualized it. They have cultivated tolerance but they have not conceptualized it.

source: བརྩོན་འགྲུས་བརྩམས་ཀྱང་མཚན་མར་མ་བཟུང་།
en: They have undertaken perseverance but they have not conceptualized it.

source: བསམ་གཏན་ལ་མཉམ་པར་གཞག་ཀྱང་མཚན་མར་མ་བཟུང་།
en: They have become absorbed in meditative concentration but they have not conceptualized it.

source: ཤེས་རབ་བསྒོམས་ཀྱང་མཚན་མར་མ་བཟུང་།
en: They have cultivated wisdom but they have not conceptualized it.

source: འདས་པ་དང་མ་བྱོན་པ་དང་ད་ལྟར་བྱུང་བའི་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཚུལ་ཁྲིམས་དང་ཏིང་ངེ་འཛིན་དང་ཤེས་རབ་དང་རྣམ་པར་གྲོལ་བ་དང་། རྣམ་པར་གྲོལ་བའི་ཡེ་ཤེས་གཟིགས་པ་མཚན་མར་མ་བཟུང་།
en: They have not conceptualized the ethical discipline of the lord buddhas of the past, future, and present, or their meditative stability, wisdom, liberation, and seeing the wisdom of liberation.

source: སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་སྨོན་པ་མེད་པའི་ཏིང་ངེ་འཛིན་བསྒོམས་ཀྱང་མཚན་མར་མ་བཟུང་ངོ་། །ཤ་ར་དྭ་ཏིའི་བུ་དེ་ལྟར་ན་མཚན་མ་དང་བྲལ་བའི་སེམས་ཀྱིས། སྦྱིན་པ་ཡོངས་སུ་གཏོང་བ་དང་ཚུལ་ཁྲིམས་སྲུང་བ་དང་བཟོད་པ་སྒྲུབ་པ་དང་། བརྩོན་འགྲུས་རྩོམ་པ་དང་། བསམ་གཏན་ལ་མཉམ་པར་གཞོག་པ་དང་། ཤེས་རབ་བསྒོམ་པ་དང་། ནང་སྟོང་པ་ཉིད་སྒོམ་པ་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་སྒོམ་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པ་དང་། ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་སྒོམ་པ་དང་། འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་སྒོམ་པ་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་།
en: They have cultivated the meditative stabilities of emptiness, signlessness, and wishlessness but have not conceptualized them. “

source: མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་སྒོམ་པ་དང་མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་སྒོ་དང་། དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་སྒོམ་པ་དང་། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་སྒོམ་པ་འདི་ནི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོའི་ཐབས་མཁས་པའོ།། །།ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟོང་ཕྲག་ཉི་ཤུ་ལྔ་པ། བམ་པོ་ལྔ་བཅུ་པ། གསོལ་པ།
en: Śāradvatīputra, those who, with a mind free from conceptualization, dispense generosity, maintain ethical discipline, cultivate tolerance, undertake perseverance, become absorbed in meditative concentration, and cultivate wisdom; cultivate the emptiness of internal phenomena; cultivate [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities; cultivate the applications of mindfulness; cultivate the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path; cultivate the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions; cultivate the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, and wishlessness; cultivate the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas; and cultivate [the goals], up to and including all-aspect omniscience, are skilled in the means of bodhisattva great beings.” “

source: བཅོམ་ལྡན་འདས་བདག་གིས་བཅོམ་ལྡན་འདས་ཀྱིས་གསུངས་པའི་དོན་འཚལ་བ་ལྟར་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཐབས་མཁས་པ་དང་མ་བྲལ་ན། དེའི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཐེ་ཚོམ་མ་མཆིས་སོ།
en: Blessed Lord, as I understand the meaning of the words spoken by the Blessed One, there is no doubt that if bodhisattva great beings, starting from the time when they first begin to set their mind on enlightenment, are not without the perfection of wisdom and skill in means, they will attain unsurpassed, complete enlightenment.

source: །དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེས་སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དང་། གང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་བགྱི་བའི་གཟུགས་སམ། ཚོར་བའམ། འདུ་ཤེས་སམ། འདུ་བྱེད་དམ། རྣམ་པར་ཤེས་པའམ། སྐྱེ་མཆེད་དམ། ཁམས་སམ། རྟེན་ཅིང་འབྲེལ་བར་འབྱུང་བའམ། ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་སམ། སྟོང་པ་ཉིད་རྣམས་སམ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སམ། འཕགས་པའི་བདེན་པའམ། བསམ་གཏན་ནམ། ཚད་མེད་པའམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པའམ། རྣམ་པར་ཐར་པའམ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པའམ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པའམ། མངོན་པར་ཤེས་པའམ། ཏིང་ངེ་འཛིན་ཏམ། གཟུངས་ཀྱི་སྒོ་འམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་སམ། མི་འཇིགས་པ་འམ། སོ་སོ་ཡང་དག་པར་རིག་པའམ། བྱམས་པ་ཆེན་པོའམ། སྙིང་རྗེ་ཆེན་པོའམ།
en: If one were to ask why, Blessed Lord, it is because those bodhisattva great beings, starting from the time when they first begin to set their mind on enlightenment, apprehend nothing at all that would attain consummate buddhahood, or through which they would attain consummate buddhahood, whether it be physical forms, feelings, perceptions, formative predispositions, consciousness, the sense fields, the sensory elements, the links of dependent origination, the perfections, the aspects of emptiness, the thirty-seven factors conducive to enlightenment, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, the distinct qualities of the buddhas, or all-aspect omniscience. “

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པའམ། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དམ། ཆོས་གང་ཡང་དམིགས་སུ་མ་མཆིས་སོ། །བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ་རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཐབས་མཁས་པ་དང་བྲལ་བ་དེ་དག་གི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཐེ་ཚོམ་མ་མཆིས་པ་ལགས།
en: Blessed Lord, those noble sons or noble daughters who follow the vehicle of the bodhisattvas, and who are separated from the perfection of wisdom and skill in means, [should know that] their attainment of unsurpassed, complete enlightenment is in doubt.{Ki.

source: དེ་ཅིའི་སླད་དུ་ཞེ་ན། བཅོམ་ལྡན་འདས་དེ་ནི་འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གིས་སྦྱིན་པ་ཅི་དང་ཅི་བཏང་བ་དེ་དག་ཐམས་ཅད་མཚན་མར་བཟུང་སྟེ་བཏང་།
en: IV: 129} If one were to ask why, Blessed Lord, it is because those noble sons or noble daughters who follow the vehicle of the bodhisattvas have conceptualized all the generosity that they have dispensed.

source: དེ་བཞིན་དུ་ཚུལ་ཁྲིམས་གང་དང་གང་བསྲུངས་པ་དང་། བཟོད་པས་ཅི་དང་ཅི་བསྒྲུབས་པ་དང་། བརྩོན་འགྲུས་གང་དང་གང་བརྩམས་པ་དང་། བསམ་གཏན་གང་དང་གང་ལ་མཉམ་པར་བཞག་པ་དང་། ཤེས་རབ་གང་དང་གང་ལ་བསྒོམས་པ་དེ་དག་ཐམས་ཅད་མཚན་མར་བཟུང་སྟེ་བསྒོམས་པས།
en: Similarly, they have conceptualized all the ethical discipline that they have maintained, the tolerance that they have cultivated, the perseverance that they have undertaken, the meditative concentration in which they have become absorbed, and the wisdom which they have cultivated.

source: དེའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོ་དེ་དག་གི་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ནི་ཐེ་ཚོམ་མཆིས་པར་རིག་པ་ལགས་སོ།
en: This being the case, for this reason those noble sons or noble daughters should know that their attainment of unsurpassed, complete enlightenment is in doubt. “

source: །བཅོམ་ལྡན་འདས་དེའི་སླད་དུ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བར་འཚལ་བས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ཐབས་མཁས་པ་དང་མ་བྲལ་བར་བགྱིའོ།
en: For this reason, Blessed Lord, bodhisattva great beings who would attain consummate buddhahood in unsurpassed, complete enlightenment should not be separated from the perfection of wisdom and skill in means.

source: །ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་ཐབས་མཁས་པ་ལ་གནས་ཏེ། མི་དམིགས་པའི་ཚུལ་གྱིས་མཚན་མ་མེད་པ་དང་ལྡན་པའི་སེམས་ཀྱིས་སྦྱིན་པ་ཡོངས་སུ་གཏང་བར་བགྱིའོ། །ཚུལ་ཁྲིམས་བསྲུང་བར་བགྱིའོ། །བཟོད་པ་བསྒྲུབ་པར་བགྱིའོ། །བརྩོན་འགྲུས་བརྩམ་པར་བགྱིའོ། །བསམ་གཏན་ལ་མཉམ་པར་གཞག་པར་བགྱིའོ།
en: Abiding in the perfection of wisdom and endowed with skill in means, and with a mind that is free of conceptualization, they should, without apprehending anything, dispense generosity, maintain ethical discipline, cultivate tolerance, undertake perseverance, become absorbed in meditative concentration, and cultivate wisdom. [

source: །ཤེས་རབ་བསྒོམ་པར་བགྱིའོ། །ནང་སྟོང་པ་ཉིད་ལ་སྤྱད་པར་བགྱིའོ། །དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱད་པར་བགྱིའོ། །དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་སྤྱད་པར་བགྱིའོ།
en: Without apprehending anything], they should engage in the emptiness of internal phenomena, and engage in [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities. [

source: །ཡང་དག་པར་སྤོང་བ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་དང་། དབང་པོ་དང་སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱད་པར་བགྱིའོ།
en: Without apprehending anything], they should engage with the applications of mindfulness, and engage with the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path. [

source: །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་ལ་སྤྱད་པར་བགྱིའོ།
en: Without apprehending anything], they should practice the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions. [

source: །རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་།
en: Without apprehending anything], they should engage with the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, and wishlessness, and cultivate the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways. [

source: ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ལ་སྤྱད་པར་བགྱིའོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་། མི་འཇིགས་པ་དང་སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ལ་སྤྱད་པར་བགྱིའོ།
en: Without apprehending anything], they should engage with the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་སྤྱད་པར་བགྱིའོ།
en: Without apprehending anything], they should engage with [all the goals], up to and including all-aspect omniscience.”
